schedule-testing/tests/performance/k6-raw-output.txt

         /\      Grafana   /тА╛тА╛/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   тА╛тА╛\ 
  /          \   |   (  |  (тА╛)  |
 / __________ \  |_|\_\  \_____/ 


     execution: local
        script: tests/performance/load-test.js
        output: -

     scenarios: (100.00%) 1 scenario, 10 max VUs, 1m20s max duration (incl. graceful stop):
              * default: Up to 10 looping VUs for 50s over 3 stages (gracefulRampDown: 30s, gracefulStop: 30s)


running (0m01.0s), 01/10 VUs, 0 complete and 0 interrupted iterations
default   [   2% ] 01/10 VUs  01.0s/50.0s

running (0m02.0s), 01/10 VUs, 0 complete and 0 interrupted iterations
default   [   4% ] 01/10 VUs  02.0s/50.0s

running (0m03.0s), 02/10 VUs, 1 complete and 0 interrupted iterations
default   [   6% ] 02/10 VUs  03.0s/50.0s

running (0m04.0s), 02/10 VUs, 2 complete and 0 interrupted iterations
default   [   8% ] 02/10 VUs  04.0s/50.0s

running (0m05.0s), 02/10 VUs, 4 complete and 0 interrupted iterations
default   [  10% ] 02/10 VUs  05.0s/50.0s

running (0m06.0s), 03/10 VUs, 5 complete and 0 interrupted iterations
default   [  12% ] 03/10 VUs  06.0s/50.0s

running (0m07.0s), 03/10 VUs, 7 complete and 0 interrupted iterations
default   [  14% ] 03/10 VUs  07.0s/50.0s

running (0m08.0s), 04/10 VUs, 9 complete and 0 interrupted iterations
default   [  16% ] 04/10 VUs  08.0s/50.0s

running (0m09.0s), 04/10 VUs, 11 complete and 0 interrupted iterations
default   [  18% ] 04/10 VUs  09.0s/50.0s

running (0m10.0s), 04/10 VUs, 14 complete and 0 interrupted iterations
default   [  20% ] 04/10 VUs  10.0s/50.0s

running (0m11.0s), 05/10 VUs, 17 complete and 0 interrupted iterations
default   [  22% ] 05/10 VUs  11.0s/50.0s

running (0m12.0s), 05/10 VUs, 20 complete and 0 interrupted iterations
default   [  24% ] 05/10 VUs  12.0s/50.0s

running (0m13.0s), 05/10 VUs, 23 complete and 0 interrupted iterations
default   [  26% ] 05/10 VUs  13.0s/50.0s

running (0m14.0s), 05/10 VUs, 27 complete and 0 interrupted iterations
default   [  28% ] 05/10 VUs  14.0s/50.0s

running (0m15.0s), 05/10 VUs, 30 complete and 0 interrupted iterations
default   [  30% ] 05/10 VUs  15.0s/50.0s

running (0m16.0s), 05/10 VUs, 33 complete and 0 interrupted iterations
default   [  32% ] 05/10 VUs  16.0s/50.0s

running (0m17.0s), 06/10 VUs, 37 complete and 0 interrupted iterations
default   [  34% ] 06/10 VUs  17.0s/50.0s

running (0m18.0s), 06/10 VUs, 41 complete and 0 interrupted iterations
default   [  36% ] 06/10 VUs  18.0s/50.0s

running (0m19.0s), 06/10 VUs, 45 complete and 0 interrupted iterations
default   [  38% ] 06/10 VUs  19.0s/50.0s

running (0m20.0s), 06/10 VUs, 50 complete and 0 interrupted iterations
default   [  40% ] 06/10 VUs  20.0s/50.0s

running (0m21.0s), 06/10 VUs, 53 complete and 0 interrupted iterations
default   [  42% ] 06/10 VUs  21.0s/50.0s

running (0m22.0s), 06/10 VUs, 57 complete and 0 interrupted iterations
default   [  44% ] 06/10 VUs  22.0s/50.0s

running (0m23.0s), 07/10 VUs, 62 complete and 0 interrupted iterations
default   [  46% ] 07/10 VUs  23.0s/50.0s

running (0m24.0s), 07/10 VUs, 66 complete and 0 interrupted iterations
default   [  48% ] 07/10 VUs  24.0s/50.0s

running (0m25.0s), 07/10 VUs, 70 complete and 0 interrupted iterations
default   [  50% ] 07/10 VUs  25.0s/50.0s

running (0m26.0s), 07/10 VUs, 76 complete and 0 interrupted iterations
default   [  52% ] 07/10 VUs  26.0s/50.0s

running (0m27.0s), 07/10 VUs, 80 complete and 0 interrupted iterations
default   [  54% ] 07/10 VUs  27.0s/50.0s

running (0m28.0s), 07/10 VUs, 84 complete and 0 interrupted iterations
default   [  56% ] 07/10 VUs  28.0s/50.0s

running (0m29.0s), 08/10 VUs, 90 complete and 0 interrupted iterations
default   [  58% ] 08/10 VUs  29.0s/50.0s

running (0m30.0s), 08/10 VUs, 95 complete and 0 interrupted iterations
default   [  60% ] 08/10 VUs  30.0s/50.0s

running (0m31.0s), 08/10 VUs, 99 complete and 0 interrupted iterations
default   [  62% ] 08/10 VUs  31.0s/50.0s

running (0m32.0s), 08/10 VUs, 106 complete and 0 interrupted iterations
default   [  64% ] 08/10 VUs  32.0s/50.0s

running (0m33.0s), 08/10 VUs, 111 complete and 0 interrupted iterations
default   [  66% ] 08/10 VUs  33.0s/50.0s

running (0m34.0s), 08/10 VUs, 115 complete and 0 interrupted iterations
default   [  68% ] 08/10 VUs  34.0s/50.0s

running (0m35.0s), 09/10 VUs, 122 complete and 0 interrupted iterations
default   [  70% ] 09/10 VUs  35.0s/50.0s

running (0m36.0s), 09/10 VUs, 128 complete and 0 interrupted iterations
default   [  72% ] 09/10 VUs  36.0s/50.0s

running (0m37.0s), 09/10 VUs, 132 complete and 0 interrupted iterations
default   [  74% ] 09/10 VUs  37.0s/50.0s

running (0m38.0s), 09/10 VUs, 140 complete and 0 interrupted iterations
default   [  76% ] 09/10 VUs  38.0s/50.0s

running (0m39.0s), 09/10 VUs, 147 complete and 0 interrupted iterations
default   [  78% ] 09/10 VUs  39.0s/50.0s

running (0m40.0s), 09/10 VUs, 151 complete and 0 interrupted iterations
default   [  80% ] 09/10 VUs  40.0s/50.0s

running (0m41.0s), 10/10 VUs, 159 complete and 0 interrupted iterations
default   [  82% ] 10/10 VUs  41.0s/50.0s

running (0m42.0s), 09/10 VUs, 167 complete and 0 interrupted iterations
default   [  84% ] 09/10 VUs  42.0s/50.0s

running (0m43.0s), 09/10 VUs, 171 complete and 0 interrupted iterations
default   [  86% ] 09/10 VUs  43.0s/50.0s

running (0m44.0s), 07/10 VUs, 178 complete and 0 interrupted iterations
default   [  88% ] 07/10 VUs  44.0s/50.0s

running (0m45.0s), 06/10 VUs, 183 complete and 0 interrupted iterations
default   [  90% ] 06/10 VUs  45.0s/50.0s

running (0m46.0s), 05/10 VUs, 186 complete and 0 interrupted iterations
default   [  92% ] 05/10 VUs  46.0s/50.0s

running (0m47.0s), 04/10 VUs, 191 complete and 0 interrupted iterations
default   [  94% ] 04/10 VUs  47.0s/50.0s

running (0m48.0s), 03/10 VUs, 193 complete and 0 interrupted iterations
default   [  96% ] 03/10 VUs  48.0s/50.0s

running (0m49.0s), 03/10 VUs, 195 complete and 0 interrupted iterations
default   [  98% ] 03/10 VUs  49.0s/50.0s

running (0m50.0s), 01/10 VUs, 198 complete and 0 interrupted iterations
default   [ 100% ] 01/10 VUs  50.0s/50.0s

running (0m51.0s), 01/10 VUs, 198 complete and 0 interrupted iterations
default тЖУ [ 100% ] 01/10 VUs  50s


  тЦИ THRESHOLDS 

    http_req_duration
    тЬУ 'p(95)<500' p(95)=135.61ms

    http_req_failed
    тЬУ 'rate<0.05' rate=0.00%


  тЦИ TOTAL RESULTS 

    checks_total.......: 1194    23.361544/s
    checks_succeeded...: 100.00% 1194 out of 1194
    checks_failed......: 0.00%   0 out of 1194

    тЬУ main: status 200
    тЬУ main: response < 500ms
    тЬУ contacts: status 200
    тЬУ contacts: response < 500ms
    тЬУ news: status 200
    тЬУ news: response < 500ms

    HTTP
    http_req_duration..............: avg=79.83ms min=24.24ms med=86.96ms max=265.76ms p(90)=134.05ms p(95)=135.61ms
      { expected_response:true }...: avg=79.83ms min=24.24ms med=86.96ms max=265.76ms p(90)=134.05ms p(95)=135.61ms
    http_req_failed................: 0.00%  0 out of 1194
    http_reqs......................: 1194   23.361544/s

    EXECUTION
    iteration_duration.............: avg=1.49s   min=1.46s   med=1.48s   max=2s       p(90)=1.49s    p(95)=1.62s   
    iterations.....................: 199    3.893591/s
    vus............................: 1      min=1         max=10
    vus_max........................: 10     min=10        max=10

    NETWORK
    data_received..................: 1.5 MB 30 kB/s
    data_sent......................: 177 kB 3.5 kB/s



running (0m51.1s), 00/10 VUs, 199 complete and 0 interrupted iterations
default тЬУ [ 100% ] 00/10 VUs  50s